# 3 вида связи
# один к одному
# один ко многим
# много ко многим (m2m)



# выборка - предоставляет варианты ENUM
# orders=# CREATE TYPE mood AS ENUM ('sad', 'ok', 'happy');
# CREATE TYPE


# JOIN - подтягивание таблицы
# right, left, full, inner
# inner join = join
# left join - все значения левой таблицы и совпадения с правой таблицы
# right join - значения с правой таблицы и совпадения с левой таблицы
# full join 


# ON - на основании (по каким критериям связаны таблицы)


# УСЕЧЕНИЕ / УДАЛЕНИЕ ДАННЫХ В ТАБЛИЦЕ TRANCATE TABLE table_name;


# левая таблица - та, через которую идет запрос